yz471686525-eng/nuttx/arch/arm/src/bk7258/bk7258_gc9d01.c
/****************************************************************************
 * arch/arm/src/bk7258/bk7258_gc9d01.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Bit-bang SPI driver for the GC9D01 160x160 RGB565 LCD on BK7258 DevKit.
 *
 * Pin mapping (from schematic, confirmed against ARMINO gpio_map.h):
 *   SCLK = GPIO_2  (QSPI1_CLK, func6 — unused for bit-bang)
 *   CS   = GPIO_3  (QSPI1_CSN, func6 — unused for bit-bang)
 *   MOSI = GPIO_4  (QSPI1_IO0, func6 — unused for bit-bang)
 *   DC   = GPIO_5  (QSPI1_IO1, func6 — unused for bit-bang)
 *   RST  = GPIO_29 (LCD_RST on schematic, pin 65)
 *   BL   = GPIO_25 (LCD_BL_PWM via Q3)
 *
 * The GC9D01 uses a separate DC pin (not 9-bit SPI).  DC=LOW for command,
 * DC=HIGH for data.  SPI mode 0, MSB first.
 *
 * Staged test via NSH command "lcdtest":
 *   lcdtest          — staged bring-up (A=backlight, B=init, C=red sq)
 *   lcdtest go       — one-step reliable LCD bring-up (production flow)
 *   lcdtest pwr lo hi — power-on GPIO range for binary-search
 *   lcdtest scan     — GPIO pin scan for LCD power enable
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/nuttx.h>

#include "arm_internal.h"
#include "hardware/bk7258_memorymap.h"
#include "hardware/bk7258_gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Shared pin */

#define LCD_PIN_BL     25

/* Per-panel pin descriptor */

typedef struct
{
  int sclk;
  int cs;
  int mosi;
  int dc;
  int rst;
} lcd_pins_t;

static const lcd_pins_t g_lcd_left =
{
  .sclk = 2, .cs = 3, .mosi = 4, .dc = 5, .rst = 29
};

static const lcd_pins_t g_lcd_right =
{
  .sclk = 22, .cs = 23, .mosi = 24, .dc = 7, .rst = 6
};

/* Currently active panel — all SPI functions use this */

static const lcd_pins_t *g_active_pins = &g_lcd_left;

/* Display geometry */

#define LCD_WIDTH      160
#define LCD_HEIGHT     160
#define LCD_BPP        16  /* RGB565 */

/* Test square size (Stage C) */

#define SQ_SIZE        40

/* SPI bit-bang delay: a few NOPs for timing margin. */

#define spi_delay() \
  do { \
    __asm__ volatile("nop; nop; nop; nop;"); \
  } while (0)

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gpio_set_output
 ****************************************************************************/

static void gpio_set_output(int pin)
{
  uint32_t cfg = getreg32(BK7258_GPIO_CFG(pin));

  cfg &= ~GPIO_CFG_SECOND_FUNC;  /* GPIO mode (bit6 = 0) */
  cfg &= ~GPIO_CFG_OUTPUT_EN;    /* output enable (bit3 active-low: 0 = on) */
  cfg &= ~GPIO_CFG_INPUT_EN;     /* input disable (bit2 active-high: 0 = off) */
  putreg32(cfg, BK7258_GPIO_CFG(pin));
}

/****************************************************************************
 * Name: gpio_write
 ****************************************************************************/

static void gpio_write(int pin, int val)
{
  uint32_t cfg = getreg32(BK7258_GPIO_CFG(pin));

  if (val)
    {
      cfg |= GPIO_CFG_OUTPUT;
    }
  else
    {
      cfg &= ~GPIO_CFG_OUTPUT;
    }

  putreg32(cfg, BK7258_GPIO_CFG(pin));
}

/****************************************************************************
 * Name: lcd_set_pins / lcd_setup_pins
 ****************************************************************************/

static void lcd_set_pins(const lcd_pins_t *pins)
{
  g_active_pins = pins;
}

static void lcd_setup_pins(const lcd_pins_t *pins)
{
  lcd_set_pins(pins);
  gpio_set_output(pins->sclk);
  gpio_set_output(pins->cs);
  gpio_set_output(pins->mosi);
  gpio_set_output(pins->dc);
  gpio_set_output(pins->rst);
  gpio_write(pins->cs, 1);
  gpio_write(pins->dc, 1);
  gpio_write(pins->sclk, 0);
  gpio_write(pins->mosi, 0);
}

/****************************************************************************
 * Name: spi_write_byte
 ****************************************************************************/

static void spi_write_byte(uint8_t byte)
{
  int bit;

  for (bit = 7; bit >= 0; bit--)
    {
      gpio_write(g_active_pins->mosi, (byte >> bit) & 1);
      spi_delay();
      gpio_write(g_active_pins->sclk, 1);
      spi_delay();
      gpio_write(g_active_pins->sclk, 0);
    }
}

/****************************************************************************
 * Name: lcd_send_cmd / lcd_send_data / lcd_send_cmd_data
 ****************************************************************************/

static void lcd_send_cmd(uint8_t cmd)
{
  gpio_write(g_active_pins->dc, 0);
  gpio_write(g_active_pins->cs, 0);
  spi_write_byte(cmd);
  gpio_write(g_active_pins->cs, 1);
}

static void lcd_send_data(const uint8_t *data, int len)
{
  int i;

