yz471686525-eng/nuttx/arch/arm/src/bk7258/bk7258_gc9d01.c
  gpio_write(g_active_pins->dc, 1);
  gpio_write(g_active_pins->cs, 0);
  for (i = 0; i < len; i++)
    {
      spi_write_byte(data[i]);
    }

  gpio_write(g_active_pins->cs, 1);
}

static void lcd_send_cmd_data(uint8_t cmd, const uint8_t *data, int len)
{
  lcd_send_cmd(cmd);
  if (len > 0)
    {
      lcd_send_data(data, len);
    }
}

/****************************************************************************
 * Name: lcd_init_sequence
 *
 * Description:
 *   Full GC9D01 init sequence from ARMINO lcd_spi_gc9d01.c.
 *   If display_on is true, sends 0x29 (display on) at the end;
 *   otherwise leaves the display off so the caller can fill the
 *   framebuffer first (avoids flash of uninitialised GRAM).
 *
 ****************************************************************************/

static void lcd_init_sequence(bool display_on)
{
  lcd_send_cmd(0xfe);
  lcd_send_cmd(0xef);

  lcd_send_cmd_data(0x80, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x81, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x82, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x83, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x84, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x85, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x86, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x87, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x88, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x89, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x8a, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x8b, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x8c, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x8d, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x8e, (const uint8_t *)"\xff", 1);
  lcd_send_cmd_data(0x8f, (const uint8_t *)"\xff", 1);

  lcd_send_cmd_data(0x3a, (const uint8_t *)"\x05", 1);
  lcd_send_cmd_data(0xec, (const uint8_t *)"\x01", 1);
  lcd_send_cmd_data(0x74,
    (const uint8_t *)"\x02\x0e\x00\x00\x00\x00\x00", 7);
  lcd_send_cmd_data(0x98, (const uint8_t *)"\x3e\x99\x3e", 3);
  lcd_send_cmd_data(0xb5, (const uint8_t *)"\x0d\x0d", 2);
  lcd_send_cmd_data(0x60,
    (const uint8_t *)"\x38\x0f\x79\x67", 4);
  lcd_send_cmd_data(0x61,
    (const uint8_t *)"\x38\x11\x79\x67", 4);
  lcd_send_cmd_data(0x64,
    (const uint8_t *)"\x38\x17\x71\x5f\x79\x67", 6);
  lcd_send_cmd_data(0x65,
    (const uint8_t *)"\x38\x13\x71\x5b\x79\x67", 6);
  lcd_send_cmd_data(0x6a, (const uint8_t *)"\x00\x00", 2);
  lcd_send_cmd_data(0x6c,
    (const uint8_t *)"\x22\x02\x22\x02\x22\x22\x50", 7);
  lcd_send_cmd_data(0x6e,
    (const uint8_t *)"\x03\x03\x01\x01\x00\x00"
                     "\x0f\x0f\x0d\x0d\x0b\x0b"
                     "\x09\x09\x00\x00\x00\x00"
                     "\x0a\x0a\x0c\x0c\x0e\x0e"
                     "\x10\x10\x00\x00\x02\x02"
                     "\x04\x04", 32);
  lcd_send_cmd_data(0xbf, (const uint8_t *)"\x01", 1);
  lcd_send_cmd_data(0xf9, (const uint8_t *)"\x40", 1);
  lcd_send_cmd_data(0x9b, (const uint8_t *)"\x3b", 1);
  lcd_send_cmd_data(0x93, (const uint8_t *)"\x33\x7f\x00", 3);
  lcd_send_cmd_data(0x7e, (const uint8_t *)"\x30", 1);
  lcd_send_cmd_data(0x70,
    (const uint8_t *)"\x0d\x02\x08\x0d\x02\x08", 6);
  lcd_send_cmd_data(0x71,
    (const uint8_t *)"\x0d\x02\x08", 3);
  lcd_send_cmd_data(0x91, (const uint8_t *)"\x0e\x09", 2);
  lcd_send_cmd_data(0xc3, (const uint8_t *)"\x18", 1);
  lcd_send_cmd_data(0xc4, (const uint8_t *)"\x18", 1);
  lcd_send_cmd_data(0xc9, (const uint8_t *)"\x3c", 1);
  lcd_send_cmd_data(0xf0,
    (const uint8_t *)"\x13\x15\x04\x05\x01\x38", 6);
  lcd_send_cmd_data(0xf2,
    (const uint8_t *)"\x13\x15\x04\x05\x01\x34", 6);
  lcd_send_cmd_data(0xf1,
    (const uint8_t *)"\x4b\xb8\x7b\x34\x35\xef", 6);
  lcd_send_cmd_data(0xf3,
    (const uint8_t *)"\x47\xb4\x72\x34\x35\xda", 6);
  lcd_send_cmd_data(0x36, (const uint8_t *)"\x00", 1);

  lcd_send_cmd(0x34);  /* tearing effect off */
  lcd_send_cmd(0x11);  /* sleep out */
  up_mdelay(120);

  if (display_on)
    {
      lcd_send_cmd(0x29);  /* display on */
    }
}

/****************************************************************************
 * Name: lcd_display_on
 *
 * Description:
 *   Send 0x29 (display on) — call after framebuffer is ready.
 *
 ****************************************************************************/

static void lcd_display_on(void)
{
  lcd_send_cmd(0x29);
}

/****************************************************************************
 * Name: lcd_fill_rect
 *
 * Description:
 *   Fill a rectangle (x0,y0)-(x1,y1) with a single RGB565 color.
 *   Much smaller than full-screen fill — avoids millions of bit-bangs.
 *
 ****************************************************************************/

static void lcd_fill_rect(uint16_t x0, uint16_t y0,
                          uint16_t x1, uint16_t y1,
                          uint16_t color)
{
  uint8_t ca[4];
  uint8_t ra[4];
  uint8_t hi = (color >> 8) & 0xff;
  uint8_t lo = color & 0xff;
  int npix = (int)(x1 - x0 + 1) * (int)(y1 - y0 + 1);
  int i;

  /* CASET */

  ca[0] = (x0 >> 8) & 0xff;
  ca[1] = x0 & 0xff;
  ca[2] = (x1 >> 8) & 0xff;
  ca[3] = x1 & 0xff;
  lcd_send_cmd_data(0x2a, ca, 4);

  /* RASET */

  ra[0] = (y0 >> 8) & 0xff;
  ra[1] = y0 & 0xff;
  ra[2] = (y1 >> 8) & 0xff;
  ra[3] = y1 & 0xff;
  lcd_send_cmd_data(0x2b, ra, 4);

  /* RAMWR + pixel data */

  lcd_send_cmd(0x2c);
  gpio_write(g_active_pins->dc, 1);
  gpio_write(g_active_pins->cs, 0);
  for (i = 0; i < npix; i++)
    {
      spi_write_byte(hi);
      spi_write_byte(lo);
    }

  gpio_write(g_active_pins->cs, 1);
}

/****************************************************************************
 * Name: sqrt_int — integer square root (Newton's method)
 ****************************************************************************/

static int16_t sqrt_int(int32_t val)
{
  int32_t guess;
  int32_t next;
  int i;

  if (val <= 0)
    {
      return 0;
    }

  guess = val;

  for (i = 0; i < 10; i++)
    {
      next = (guess + val / guess) / 2;

      if (next >= guess)
        {
          break;
        }

