yz471686525-eng/nuttx/arch/arm/src/bk7258/bk7258_gc9d01.c
      guess = next;
    }

  return (int16_t)guess;
}

/****************************************************************************
 * Name: lcd_fill_circle
 *
 * Description:
 *   Fill a circle centred at (cx,cy) with radius r using scanline
 *   rendering.  Each scanline is a 1px-high lcd_fill_rect call.
 *
 ****************************************************************************/

static void lcd_fill_circle(int16_t cx, int16_t cy, int16_t r,
                            uint16_t color)
{
  int16_t y;
  int16_t dx;
  int16_t x0;
  int16_t x1;
  int32_t r2 = (int32_t)r * r;

  for (y = cy - r; y <= cy + r; y++)
    {
      int32_t dy  = (int32_t)(y - cy);
      int32_t rem = r2 - dy * dy;

      if (rem < 0)
        {
          continue;
        }

      dx = sqrt_int(rem);
      x0 = cx - dx;
      x1 = cx + dx;

      if (x0 < 0)
        {
          x0 = 0;
        }

      if (x1 >= LCD_WIDTH)
        {
          x1 = LCD_WIDTH - 1;
        }

      if (y < 0 || y >= LCD_HEIGHT)
        {
          continue;
        }

      lcd_fill_rect(x0, y, x1, y, color);
    }
}

/****************************************************************************
 * Name: draw_eye
 *
 * Description:
 *   Draw a cute robot eye on the currently active panel:
 *     black background → cyan iris → white highlight
 *
 ****************************************************************************/

static void draw_eye(void)
{
  syslog(LOG_INFO, "[eye] fill black\n");
  lcd_fill_rect(0, 0, LCD_WIDTH - 1, LCD_HEIGHT - 1, 0x0000);

  syslog(LOG_INFO, "[eye] cyan iris r=60 at (80,80)\n");
  lcd_fill_circle(80, 80, 60, 0x07ff);

  syslog(LOG_INFO, "[eye] white highlight r=16 at (62,60)\n");
  lcd_fill_circle(62, 60, 16, 0xffff);
}

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lcdtest_stages
 *
 * Description:
 *   Staged LCD bring-up: A=backlight, B=init, C=40x40 red square.
 *
 ****************************************************************************/

static int lcdtest_stages(void)
{
  /* --- Stage A: backlight --- */

  syslog(LOG_INFO,
         "[lcdtest] Stage A: backlight ON (P25 high)\n");

  gpio_set_output(LCD_PIN_BL);
  gpio_write(LCD_PIN_BL, 1);
  up_mdelay(1000);

  syslog(LOG_INFO,
         "[lcdtest] Stage A done - screen should be lit white\n");

  /* --- Stage B: reset + init --- */

  syslog(LOG_INFO,
         "[lcdtest] Stage B: RST(P29) reset + GC9D01 init\n");

  lcd_setup_pins(&g_lcd_left);

  gpio_write(g_active_pins->rst, 0);
  up_mdelay(10);
  gpio_write(g_active_pins->rst, 1);
  up_mdelay(120);

  lcd_init_sequence(true);

  syslog(LOG_INFO,
         "[lcdtest] Stage B done - panel initialized\n");

  /* --- Stage C: 40x40 red square --- */

  syslog(LOG_INFO,
         "[lcdtest] Stage C: fill 40x40 red at (60,60)\n");

  lcd_fill_rect(60, 60,
                60 + SQ_SIZE - 1, 60 + SQ_SIZE - 1,
                0xf800);

  syslog(LOG_INFO,
         "[lcdtest] Stage C done - look for red square\n");

  return OK;
}

/****************************************************************************
 * Name: lcdtest_scan
 *
 * Description:
 *   Scan GPIO 0-47 for the LCD power enable pin.
 *   Strategy: cumulative — pull each pin high and leave it high, so that
 *   if multiple pins need to be high simultaneously the condition is met.
 *   P25 (backlight) is held high throughout.  UART console pins (10, 11)
 *   and LCD signal pins (2-5, 29) are skipped to keep the console and
 *   SPI bus alive.
 *
 ****************************************************************************/

static int lcdtest_scan(void)
{
  int pin;

  /* Backlight on first */

  gpio_set_output(LCD_PIN_BL);
  gpio_write(LCD_PIN_BL, 1);

  syslog(LOG_INFO,
         "[scan] backlight P25 high, scanning GPIO 0-47 ...\n");

  for (pin = 0; pin <= 47; pin++)
    {
      /* Skip UART0 console: RX=10, TX=11 */

      if (pin == 10 || pin == 11)
        {
          syslog(LOG_INFO,
                 "[scan] pin=%d skipped (UART0 console)\n", pin);
          continue;
        }

      /* Skip LCD signal pins (both eyes + backlight) */

      if (pin == g_lcd_left.sclk  || pin == g_lcd_left.cs  ||
          pin == g_lcd_left.mosi  || pin == g_lcd_left.dc  ||
          pin == g_lcd_left.rst   ||
          pin == g_lcd_right.sclk || pin == g_lcd_right.cs ||
          pin == g_lcd_right.mosi || pin == g_lcd_right.dc ||
          pin == g_lcd_right.rst  ||
          pin == LCD_PIN_BL)
        {
          syslog(LOG_INFO,
                 "[scan] pin=%d skipped (LCD signal)\n", pin);
          continue;
        }

      /* Skip SWD debug port: SWCLK=20, SWDIO=21 */

      if (pin == 20 || pin == 21)
        {
          syslog(LOG_INFO,
                 "[scan] pin=%d skipped (SWD debug)\n", pin);
          continue;
        }

      gpio_set_output(pin);
      gpio_write(pin, 1);
      up_mdelay(800);

      syslog(LOG_INFO, "[scan] pin=%d high\n", pin);
    }

  syslog(LOG_INFO,
         "[scan] done - check screen for any change\n");

  return OK;
}

/****************************************************************************
 * Name: lcdtest_pwr
 *
 * Description:
 *   Full power-on sequence with configurable GPIO range for binary-search
 *   identification of the LCD power enable pin.
 *
 *   Usage: lcdtest pwr [lo] [hi]
 *     lo..hi  — decimal GPIO range to drive high (default 0..52)
 *
 *   Always skips: 2,3,4,5,25,29 (LCD)  10,11 (UART)  7,8 (motor)
 *                 20,21 (SWD)  38,39 (LEDs)
 *
 ****************************************************************************/

static int lcdtest_pwr(int lo, int hi)
{
  int pin;
  int count = 0;
  int off = 0;
  char pinbuf[256];

  /* Step 1: drive GPIO lo..hi high, skip reserved pins.
   * Collect the actual pin list for the syslog dump.
   */

  syslog(LOG_INFO,
         "[pwr] step1: GPIO %d-%d high (skip reserved)\n",
         lo, hi);

  for (pin = lo; pin <= hi; pin++)
    {
      /* LCD signals (both eyes) */

      if (pin == 2 || pin == 3 || pin == 4 || pin == 5 ||
          pin == 6 || pin == 7 || pin == 22 || pin == 23 ||
          pin == 24 || pin == 25 || pin == 29)
        {
          continue;
        }

      /* UART0 console */

      if (pin == 10 || pin == 11)
        {
          continue;
        }

      /* Vibration motor (P7 is right-eye DC, only skip P8) */

