yz471686525-eng/nuttx/arch/arm/src/bk7258/bk7258_gc9d01.c
      if (pin == 8)
        {
          continue;
        }

      /* Indicator LEDs */

      if (pin == 38 || pin == 39)
        {
          continue;
        }

      /* SWD debug port: SWCLK=20, SWDIO=21 */

      if (pin == 20 || pin == 21)
        {
          continue;
        }

      gpio_set_output(pin);
      gpio_write(pin, 1);
      count++;

      if (off < (int)sizeof(pinbuf) - 8)
        {
          off += snprintf(pinbuf + off, sizeof(pinbuf) - off,
                          " %d", pin);
        }
    }

  pinbuf[off] = '\0';

  /* Print which pins were actually driven high */

  syslog(LOG_INFO,
         "[pwr] driven high (%d pins):%s\n", count, pinbuf);

  /* Step 2: wait for power rails to settle */

  syslog(LOG_INFO, "[pwr] step2: wait 50 ms ...\n");
  up_mdelay(50);

  /* Step 3: backlight on */

  syslog(LOG_INFO, "[pwr] step3: backlight P25 high\n");
  gpio_set_output(LCD_PIN_BL);
  gpio_write(LCD_PIN_BL, 1);

  /* Step 4: setup left-eye SPI pins + hardware reset */

  syslog(LOG_INFO,
         "[pwr] step4: left SPI setup + RST low 15 ms then high\n");
  lcd_setup_pins(&g_lcd_left);
  gpio_write(g_active_pins->rst, 0);
  up_mdelay(15);
  gpio_write(g_active_pins->rst, 1);
  up_mdelay(120);

  /* Step 5: GC9D01 init sequence */

  syslog(LOG_INFO, "[pwr] step5: GC9D01 init sequence\n");
  lcd_init_sequence(true);

  /* Step 6: clear screen to black */

  syslog(LOG_INFO, "[pwr] step6: fill screen black\n");
  lcd_fill_rect(0, 0, LCD_WIDTH - 1, LCD_HEIGHT - 1, 0x0000);

  /* Step 7: draw 40x40 red square at (60,60) */

  syslog(LOG_INFO,
         "[pwr] step7: fill 40x40 red at (60,60)\n");
  lcd_fill_rect(60, 60,
                60 + SQ_SIZE - 1, 60 + SQ_SIZE - 1,
                0xf800);

  syslog(LOG_INFO,
         "[pwr] done (%d pins driven) - "
         "screen should show red on black\n",
         count);
  return OK;
}

/****************************************************************************
 * Name: lcdtest_go
 *
 * Description:
 *   One-step dual-eye LCD bring-up: left (red) + right (blue).
 *
 ****************************************************************************/

static int lcdtest_go(void)
{
  int pin;
  int count = 0;

  /* Step 1: drive GPIO 0-52 high, skip reserved pins */

  syslog(LOG_INFO,
         "[go] step1: GPIO 0-52 high (skip reserved)\n");

  for (pin = 0; pin <= 52; pin++)
    {
      /* LCD signals (both eyes + backlight) */

      if (pin == 2 || pin == 3 || pin == 4 || pin == 5 ||
          pin == 6 || pin == 7 || pin == 22 || pin == 23 ||
          pin == 24 || pin == 25 || pin == 29)
        {
          continue;
        }

      /* UART0 console */

      if (pin == 10 || pin == 11)
        {
          continue;
        }

      /* Vibration motor (P7 is right-eye DC, only skip P8) */

      if (pin == 8)
        {
          continue;
        }

      /* Indicator LEDs */

      if (pin == 38 || pin == 39)
        {
          continue;
        }

      /* SWD debug port: SWCLK=20, SWDIO=21 */

      if (pin == 20 || pin == 21)
        {
          continue;
        }

      gpio_set_output(pin);
      gpio_write(pin, 1);
      count++;
    }

  syslog(LOG_INFO, "[go] step1 done: %d pins driven high\n", count);

  /* Step 2: wait for power rails to settle */

  syslog(LOG_INFO, "[go] step2: wait 500 ms for power stable\n");
  up_mdelay(500);

  /* Step 3: backlight on (shared) */

  syslog(LOG_INFO, "[go] step3: backlight P25 high\n");
  gpio_set_output(LCD_PIN_BL);
  gpio_write(LCD_PIN_BL, 1);

  /* ---- Left eye ---- */

  syslog(LOG_INFO, "[go] step4 [left]: SPI pins setup\n");
  lcd_setup_pins(&g_lcd_left);

  syslog(LOG_INFO, "[go] step5 [left]: RST + init (display off)\n");
  gpio_write(g_active_pins->rst, 0);
  up_mdelay(15);
  gpio_write(g_active_pins->rst, 1);
  up_mdelay(120);
  lcd_init_sequence(false);

  syslog(LOG_INFO, "[go] step6 [left]: draw eye\n");
  draw_eye();

  syslog(LOG_INFO, "[go] step7 [left]: display on\n");
  lcd_display_on();

  /* ---- Right eye ---- */

  syslog(LOG_INFO, "[go] step9 [right]: SPI pins setup\n");
  lcd_setup_pins(&g_lcd_right);

  syslog(LOG_INFO, "[go] step10 [right]: RST + init (display off)\n");
  gpio_write(g_active_pins->rst, 0);
  up_mdelay(15);
  gpio_write(g_active_pins->rst, 1);
  up_mdelay(120);
  lcd_init_sequence(false);

  syslog(LOG_INFO, "[go] step11 [right]: draw eye\n");
  draw_eye();

  syslog(LOG_INFO, "[go] step12 [right]: display on\n");
  lcd_display_on();

  syslog(LOG_INFO,
         "[go] done - both eyes show robot eye\n");
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_lcdtest_main
 *
 * Description:
 *   NSH command "lcdtest":
 *     lcdtest          — staged bring-up (A/B/C, diagnostics)
 *     lcdtest go       — one-step reliable LCD bring-up
 *     lcdtest pwr lo hi — power-on GPIO range for binary-search
 *     lcdtest scan     — GPIO pin scan for LCD power enable
 *
 ****************************************************************************/

int bk7258_lcdtest_main(int argc, char *argv[])
{
  if (argc > 1 && strcmp(argv[1], "go") == 0)
    {
      return lcdtest_go();
    }

  if (argc > 1 && strcmp(argv[1], "scan") == 0)
    {
      return lcdtest_scan();
    }

  if (argc > 1 && strcmp(argv[1], "pwr") == 0)
    {
      int lo = 0;
      int hi = 52;

      if (argc > 2)
        {
          lo = atoi(argv[2]);
        }

      if (argc > 3)
        {
          hi = atoi(argv[3]);
        }

      if (lo < 0)
        {
          lo = 0;
        }

      if (hi > 52)
        {
          hi = 52;
        }

      if (lo > hi)
        {
          syslog(LOG_ERR,
                 "[pwr] error: lo(%d) > hi(%d)\n", lo, hi);
          return -EINVAL;
        }

      return lcdtest_pwr(lo, hi);
    }

  return lcdtest_stages();
}
